
#此函数用来打印菜单
def show_menu():
    print('+------------+------+----------------------+')
    print('|  1) 添加学生信息                         |')
    print('|  2) 查看所有学生信息                     |')
    print('|  3) 修改学生的成绩                       |')
    print('|  4) 删除学生信息                         |')
    print('|  5) 按成绩从高到低打印学生信息           |')
    print('|  6) 按成绩从低到高打印学生信息           |')
    print('|  7) 按年龄从高到低打印学生信息           |')
    print('|  8) 按年龄从低到高打印学生信息           |')
    print('|  9) 保存输入到si.txt                    |')    
    print('|  10) 读取si.txt的信息                    |')
    print('|  q) 退出                                 |')
    print('+------------+------+----------------------+')
